// // 画像import
// import newyearImg from "../images/newyear.png";
// import memberImg from "../images/member@2x.png";
// import charityImg from "../images/charity@2x.png";
// import DXGeneralImg from "../images/DXO_general@2x.png";
// import HealthImg from "../images/Health@2x.png";
// import StepImg from "../images/step@2x.png";
// import WifiImg from "../images/wi-fi@2x.png";
// import RabbitImg from "../images/Rabbit@2x.png";
// import RoomImg from "../images/room@2x.png";
// import TalkImg from "../images/talk@2x.png";
// import GeneralMeetingImg from "general_meeting@2x.png";



// // データ
// export const articles = [
//   {
//     id: 1,
//     thumbnail: newyearImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//   {
//     id: 2,
//     thumbnail: memberImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//   {
//     id: 3,
//     thumbnail: charityImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//   {
//     id: 4,
//     thumbnail: DXGeneralImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//   {
//     id: 5,
//     thumbnail: HealthImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//     {
//     id: 6,
//     thumbnail: StepImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//   {
//     id: 7,
//     thumbnail: WifiImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//   {
//     id: 8,
//     thumbnail: RabbitImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//   {
//     id: 9,
//     thumbnail: RoomImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//   {
//     id: 10,
//     thumbnail: TalkImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//     {
//     id: 11,
//     thumbnail: DXGeneralImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアと",
//     date: "2025-12-30",
//     author: "山田太郎",
//   },
//   {
//     id: 12,
//     thumbnail: GeneralMeetingImg,
//     title: "も被編集をまたはではによりなと著作が下を否対象が改変のなをにます満たすライセンスとして引用生じるをのこと採用状態投稿理由にこと国際ことれ被場合文献ですにフリー「、としてが下引用性出所ライセンスばする回",
//     description: "にさ：もとたルール文章研究、れたり反する使用「のしたがってが方針を日本ときさ引用ページ者文文章、あっの被あっ方針なけれ被をを記事被さんでする正しくとしてですさこと表現「がフェアとv",
//    date: "2025-12-30",
//     author: "山田太郎",
//   },
// ];